OpenFOAM/4.x/ERCOFTAC-SIG15/case4.5/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        perturb         1e-05;
        offset          0;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    Wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    sym
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
