OpenFOAM/4.x/ERCOFTAC-SIG15/case4.5/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
11000
(
0.14605457
0.14605457
0.14605457
0.14605457
0.14605457
0.14605457
0.14605457
0.14605457
...
)
;
    }
    sym
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
