OpenFOAM/4.x/ERCOFTAC-SIG15/case4.5/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;;
    class       dictionary;;
    object      blockMeshDict;;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.203;

vertices        
(
(3 -4.5 0) // 0
(3.5 -4.5 0) // 1
(3.5 0 0) // 2
(3 0 0) // 3
(3 -4.5 3) // 4
(3.5 -4.5 3) // 5
(3.5 0 3) // 6
(3 0 3) // 7

(4 -4.5 0) // 8
(4 0 0) // 9
(4 -4.5 3) // 10
(4 0 3) // 11

(0 3 0) // 12
(0 3.5 0) // 13
(0 4 0) // 14
(0 3 3) // 15
(0 3.5 3) // 16
(0 4 3) // 17

(-25.5 3 0) // 18
(-25.5 3.5 0) // 19
(-25.5 4 0) // 20
(-25.5 3 3) // 21
(-25.5 3.5 3) // 22
(-25.5 4 3) // 23
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (20 20 30) simpleGrading (20 0.2 40)
    hex (1 8 9 2 5 10 11 6) (20 20 30) simpleGrading (0.05 0.2 40)
    hex (3 2 13 12 7 6 16 15) (20 45 30) simpleGrading (20 1 40)
    hex (2 9 14 13 6 11 17 16) (20 45 30) simpleGrading (0.05 1 40)
    hex (12 13 19 18 15 16 22 21) (20 45 30) simpleGrading (20 20 40)
    hex (13 14 20 19 16 17 23 22) (20 45 30) simpleGrading (0.05 20 40)
);

edges           
(
 arc 3 12 (2.121320344 2.121320344 0)
 arc 2 13 (2.474873734 2.474873734 0)
 arc 9 14 (2.828427125 2.828427125 0)
 arc 7 15 (2.121320344 2.121320344 3)
 arc 6 16 (2.474873734 2.474873734 3)
 arc 11 17 (2.828427125 2.828427125 3)
);

patches         
(
    patch inlet 
    (
    (4 0 1 5)
    (5 1 8 10)
    )
    patch outlet 
    (
    (21 22 19 18)
    (22 23 20 19)
    )
    wall Wall 
    (
// side surface
    (11 9 8 10)
    (17 14 9 11)
    (23 20 14 17)
    (12 15 21 18)
    (3 7 15 12)
    (0 4 7 3)
// top surface
    (12 13 19 18)
    (13 14 20 19)
    (3 2 13 12)
    (2 9 14 13)
    (0 1 2 3)
    (1 8 9 2)
    )
    symmetryPlane sym  
    (
    (4 5 6 7)
    (5 10 11 6)
    (7 6 16 15)
    (6 11 17 16)
    (15 16 22 21)
    (16 17 23 22)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
