OpenFOAM/4.x/ERCOFTAC-SIG15/case4.5/system/functionAverage
    Average
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   timeStep;
        interval        1;
        log             true;
        valueOutput     false;
        source          all;
        sourceName      all;
        operation       volAverage;
        fields
        (
            U
            p
	    k
	    epsilon
	    omega
        );
    }
